{
    "version": "https://jsonfeed.org/version/1",
    "title": "ruby&#x27;s website",
    "description": "",
    "home_page_url": "https://mattly.github.io/rubys-website",
    "feed_url": "https://mattly.github.io/rubys-website/feed.json",
    "user_comment": "",
    "author": {
        "name": "Ruby Barmes"
    },
    "items": [
        {
            "id": "https://mattly.github.io/rubys-website/recommendations.html",
            "url": "https://mattly.github.io/rubys-website/recommendations.html",
            "title": "recommendations",
            "summary": "Podcast Recommendations: The Adventure Zone - the OG dnd podcast. Imagine a dnd game where one player names their character Taco as a goof and 300 hours later you are weeping openly about Taako and his friend Bary Bluejeans. Worlds Beyond Number - a dnd&hellip;",
            "content_html": "\n    <h2 id=\"podcast-recommendationslessbrgreater\">\n      Podcast Recommendations:<br>\n    </h2>\n\n  <p>\n    The Adventure Zone - the OG dnd podcast. Imagine a dnd game where one player names their character Taco as a goof and 300 hours later you are weeping openly about Taako and his friend Bary Bluejeans.\n  </p>\n\n  <p>\n    Worlds Beyond Number - a dnd podcast of absolute titans, with no-holds-barred story telling. Brennan Lee Mulligan, Aabria Iyengar, Erika Ishii, and Lou Wilson. With mind-blowing sound design. An absolute wonder for the ears. Get on their Patreon and get their behind the scenes chats and sidequests.\n  </p>\n\n  <p>\n    NADDPOD - dungeon master Brian Murphy is a genius of technical mechanics and also manages to keep the show on the rails with his wife, Emily Axford, throwing every single wrench into every single plan. Comedy gold, brilliant story telling. Also Jake and Caldwell are there, too.\n  </p>\n\n  <p>\n    Also, shout-out to other McElroy products. They’re a comedy family who really bring the family. My Brother, My Brother, and Me and Wonderful! are just spots of familiar sunshine in my life. <br><br>\n  </p>\n\n    <h2 id=\"book-recommenations\">\n      Book Recommenations\n    </h2>\n\n    <h3 id=\"my-favorite-books\">\n      My Favorite books:\n    </h3>\n\n  <p>\n    - The Last Unicorn by Peter S Beagle<br>- This Alien Shore by C. S. Friedman\n  </p>\n\n    <h3 id=\"author-recommendationslessbrgreater\">\n      Author Recommendations:<br>\n    </h3>\n\n  <p>\n    Naomi Novik - the Sholomance Trilogy was an absolute banger, and a palate cleanser for magical school. Uprooted was so so fun, Spinning Silver was great. Check her out, she’s great.<br><br>T. Kingfisher - the Saint of Steel series is just a romp, so much fun making fun of paladins and their adorable do-goodiness. But What Moves the Dead was so creepy and great, same with Nettle &amp; Bone. Check her out!<br><br>Jordan Ifueko - Raybearer trilogy was fantastic - simultaneously vibrant and so relatable. Of course I wouldn’t tell my best friends that demons were torturing me. I wouldn’t want to burden them, either.<br><br>Tamsin Muir - if you haven’t read the Locked Tomb series yet I cannot prepare you at all. Lesbian necromancers in space. The second book has soup.<br><br>Tamora Pierce - the best of YA. Everything she writes is golden.<br><br>and more!\n  </p>\n\n    <h3 id=\"watch-recommendations\">\n      Watch Recommendations\n    </h3>\n\n  <p>\n    Dropout is a media company that produces some of my favorite shows, top of the list being Dimension 20.\n  </p>\n\n  <p>\n    Dimension 20, Game Changer, Gastronauts, Make Some Noise, and so much more!<br>But truly, Dropout cares about its artists, not just cast but crew as well, and provides truly groundbreaking funny and beautiful content.\n  </p>",
            "author": {
                "name": "Ruby Barmes"
            },
            "tags": [
            ],
            "date_published": "2025-01-12T20:55:05-08:00",
            "date_modified": "2025-01-12T20:55:10-08:00"
        }
    ]
}
